{
  "contacts": [
    {
      "label": "CV",
      "link": "https://massimopalmieri.it"
    },
    {
      "label": "LinkedIn",
      "link": "https://www.linkedin.com/in/massimopalmieri"
    },
    {
      "label": "Email",
      "link": "mailto:massimo.4iy55@simplelogin.co",
      "_link": "mailto:massimo.palmieri+portfolio@gmail.com"
    },
    {
      "label": "Phone",
      "link": "tel:+447824174839"
    }
  ],
  "education": [
    {
      "school": "Suor Orsola Benincasa University of Naples",
      "title": "Bachelor's Degree in Communication Studies",
      "year": "2011"
    },
    {
      "school": "Suor Orsola Benincasa University of Naples",
      "title": "Workshops in Advertising, Visual Communication, and Marketing Planning"
    }
  ],
  "skills": [
    "JavaScript",
    "TypeScript",
    "Node.js",
    "Express.js",
    "React",
    "Next.js",
    "Remix",
    "React Native",
    "Electron.js",
    "HTML",
    "CSS",
    "CSS Preprocessors (SASS, Less)",
    "Build Systems (Webpack, Vite)",
    "Front-End Architecture",
    "Responsive Web Design",
    "User Interface (UI) and User Experience (UX) Design",
    "Performance Optimisation",
    "REST APIs",
    "Testing (Jest, Cypress, Playwright)",
    "Git and Version Control",
    "CI/CD (GitHub Actions, Jenkins)",
    "Docker",
    "Azure"
  ],
  "history": [
    {
      "employer": "Lloyds Bank",
      "title": "Lead Software Engineer",
      "start": "2019/2",
      "end": "",
      "achievements": [
        "Set the strategic direction for how components and services are developed, tested, and progressed within the engineering discipline.",
        "Collaborated with stakeholders to deliver business value through sound engineering methods and principles, ensuring platforms and software adhered to relevant patterns and practices.",
        "Ensured industry best practices were adopted by the engineering community and related business functions.",
        "Defined and communicated patterns and practices to the broader engineering community.",
        "Fostered knowledge sharing across the engineering community to provide solutions for complex business problems.",
        "Facilitated the implementation of solutions for complex business challenges.",
        "Coached engineering colleagues to ensure appropriate professional development."
      ]
    },
    {
      "employer": "Lloyds Bank",
      "title": "Lead Front-End Engineer",
      "start": "2017/10",
      "end": "2019/2",
      "achievements": [
        "Developed modular, well-tested front-end applications to ensure scalability as the codebase and business grew.",
        "Set the strategic direction for front-end application development within the team.",
        "Ensured software development aligned with established frameworks, patterns, and practices across the wider engineering community.",
        "Applied industry best practices and facilitated knowledge sharing to solve complex business problems.",
        "Mentored junior front-end engineers by providing constructive feedback and creating learning opportunities.",
        "Focused on delivering business value through robust engineering methods and principles."
      ]
    },
    {
      "employer": "NeuLion (formerly Saffron Digital)",
      "title": "Lead Front-End Developer",
      "start": "2014/3",
      "end": "2017/10",
      "achievements": [
        "Developed a premium Video on Demand (VOD) service for a major UK music retailer using React (both client- and server-side), Redux, Webpack, ES2015, and Babel.js.",
        "Implemented an HTML5 player for DRM-protected content with a custom UI and functionalities.",
        "Refactored codebase components into reusable npm modules.",
        "Built films.nolim.fr for Carrefour, a premium VOD service using AngularJS, Bootstrap, and Gulp.",
        "Developed itvessentials.com for ITV, a premium Subscription Video on Demand (SVOD) service using AngularJS, Bootstrap, and Gulp.",
        "Created ITV Essentials iOS and Android hybrid apps using AngularJS, Ionic, Cordova/PhoneGap, Bootstrap, and Gulp.",
        "Converted an existing Django CMS into a single-page Backbone app.",
        "Wrote unit tests with Jasmine and Mocha.",
        "Optimised performance and developed internal UI toolkits for other developers.",
        "Bridged UX design and development processes.",
        "Mentored and supported other front-end developers, providing feedback and guidance.",
        "Helped define coding standards for HTML, CSS/SASS, and JavaScript."
      ]
    },
    {
      "employer": "Karmarama",
      "title": "Senior Front-End Developer",
      "start": "2012/6",
      "end": "2014/3",
      "achievements": [
        "Developed high-traffic websites for leading brands such as BT, Porsche, De Beers, De Beers Forevermark, and Plusnet using HTML5, JavaScript, CSS3, and SASS.",
        "Built a hybrid mobile app for Laithwaites Wines using PhoneGap.",
        "Developed crowdwish.com and its CMS using Backbone.js.",
        "Built and optimised marketing emails for Honda and British Gas."
      ]
    },
    {
      "employer": "SocialGO",
      "title": "Front-End Developer",
      "start": "2011/4",
      "end": "2012/6",
      "achievements": [
        "Designed and coded 'house' themes for the platform.",
        "Defined standards, conventions, and guidelines for theme development.",
        "Planned and executed a broader theme strategy.",
        "Diagnosed and resolved browser compatibility issues through comprehensive testing."
      ]
    },
    {
      "employer": "De Pompeis",
      "title": "Front-End Web Developer and Designer",
      "start": "2010/10",
      "end": "2011/3",
      "achievements": [
        "Designed and developed websites.",
        "Created logos, brand identities, brochures, and packaging for mass retailers."
      ]
    },
    {
      "employer": "Arkadia",
      "title": "Front-End Web Developer and Designer",
      "start": "2007/3",
      "end": "2010/6",
      "achievements": [
        "Designed and developed front-end solutions for several websites, a web app, and a custom content management system (CMS).",
        "Created brand identities, brochures, catalogues, and packaging for various clients."
      ]
    }
  ]
}
